{"id":15569,"date":"2019-08-20T11:21:33","date_gmt":"2019-08-20T09:21:33","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=15569"},"modified":"2019-08-20T11:22:18","modified_gmt":"2019-08-20T09:22:18","slug":"accidental-scientist-tackles-food-insecurity","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/news\/accidental-scientist-tackles-food-insecurity\/","title":{"rendered":"Accidental Scientist Tackles Food Insecurity"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img loading=\"lazy\" width=\"900\" height=\"355\" src=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/08\/Accidental-Scientist-Mbali-Gwacela-Tackles-Food-Insecurity.jpg\" alt=\"\" class=\"wp-image-15570\" srcset=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/08\/Accidental-Scientist-Mbali-Gwacela-Tackles-Food-Insecurity.jpg 900w, https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/08\/Accidental-Scientist-Mbali-Gwacela-Tackles-Food-Insecurity-300x118.jpg 300w, https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/08\/Accidental-Scientist-Mbali-Gwacela-Tackles-Food-Insecurity-768x303.jpg 768w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><figcaption>UKZN female scientist, Ms Mbali Gwacela. <\/figcaption><\/figure>\n\n\n\n<p>To commemorate <a href=\"https:\/\/www.saasta.ac.za\/programmes\/focus-weeks\/national-science-week\/\">National Science Week<\/a> and National Women’s Month, the <a href=\"https:\/\/caes.ukzn.ac.za\/\">College of Agriculture, Engineering and Science<\/a> is honouring its female scientists through a <a href=\"https:\/\/wwis.ukzn.ac.za\/\">Wonder Women In Science<\/a> campaign.<\/p>\n\n\n\n<p>These women are passionate, pioneering\nand persistent heroines who are advancing science in their diverse fields. One\nof those “Wonder Women” is Ms Mbali Gwacela from the&nbsp;<a href=\"https:\/\/saees.ukzn.ac.za\/\">School of Agricultural, Earth\nand Environmental Sciences.<\/a>&nbsp;Gwacela accidentally ended up in the\nsciences, but said this field turned out to be bursting with possibilities.<\/p>\n\n\n\n<p>‘It is only when you understand the whys and hows of\nthe world you live in, that you get to appreciate all that the earth has to\noffer,’ she said.<\/p>\n\n\n\n<p>Gwacela started out in the social sciences studying\nGeography, which is where some of her earliest memories of science coming to\nlife begin. She recalls a few significant field trips with her class during\nundergraduate studies; two to the Drakensberg in the freezing cold where every rock\nstructure, soil type, and stone in and outside of the riverbed was examined.<\/p>\n\n\n\n<p>‘Literally everything we learned in class was tried\nand tested in real life. We were having so much fun as we learned and made\nreference to Professor (Trevor) Hill and Professor (Heinz) Beckedahl’s\nlectures,’ she said.<\/p>\n\n\n\n<p>A second field trip to Mtunzini, KwaZulu-Natal north\ncoast &#8211; which included everything from getting neck-deep in mud to “surfing”\ndown sand dunes &#8211; involved learning about coastal swamps, waves and dunes.<\/p>\n\n\n\n<p>‘The field trips demanded a lot of work, yet were\nextreme fun,’ said Gwacela.<\/p>\n\n\n\n<p>Her academic career would lead her to explore food\nsecurity during her postgraduate studies. Despite initially being fearful of\nscience, Gwacela said that in the subject, she discovered a field she called\n“mind-blowing” with limitless opportunities.<\/p>\n\n\n\n<p>‘I accidentally found myself in science, and when I\nrealised where I was, it was too late to change,’ she said. ‘It was then that I\nrealised I could have done science, if only I was more aware and open-minded to\nthe subject in high school, especially Mathematics.’<\/p>\n\n\n\n<p>Gwacela, who is part of the&nbsp;<a href=\"https:\/\/bwiselement.com\/\">Black Women in Science<\/a>&nbsp;non-profit\norganisation that mentors, guides and promotes science among disadvantaged\nBlack African women, encourages other young women to embrace Mathematics and\nScience instead of being intimidated by these subjects.<\/p>\n\n\n\n<p>‘These two subjects are inclusive of so many things in\nthe world that we live in,’ she said. ‘If you are not doing well, then you have\nto do more research through the internet and enquiry – use what is available to\nsimplify your understanding. I was scared of these subjects, and now I have found\nmyself within it, loving it and regretful of the opportunities missed in my\nhigh school life.’<\/p>\n\n\n\n<p>Gwacela acknowledged the urgent need for attention to\nand investment in science education in South Africa, particularly for\nmarginalised communities with little to no access to scientific resources to\nenhance understanding of scientific concepts, especially for children headed to\nuniversity. She also highlighted that even more support is needed for young\ngirls wanting to enter the sciences.<\/p>\n\n\n\n<p>She believes that women bring their unique capacity\nfor feeling and caring to the sciences, enabling them to tackle problems from\ndifferent angles and adding gentler, inclusive aspects to the way science is\napproached and applied.<\/p>\n\n\n\n<p>This role is not without its challenges, however.\n‘Being a woman in my field is very challenging, and it forces me to be\nconfident, resilient and to always have to justify or make known gender\nrelations,’ she said.<\/p>\n\n\n\n<p>Female researchers in her field also face challenges\nof acceptance in the communities they work with, often finding greater traction\nwhen accompanied by a male colleague.<\/p>\n\n\n\n<p>Being a scientist and a woman can also be mentally\nexhausting. ‘Always thinking in systems, and about how everything will affect\nothers, can be extremely draining because I am always trying to find links,\nconnections and possible outcomes or consequences in everything I do,’ she\nsaid.<\/p>\n\n\n\n<p>Gwacela, who is cognisant of the need to be an example\nto young women in science, is undertaking PhD research on community food\nsystems and their relation to and impact on household food security. She works\nclosely with communities in Swayimane, Msinga, Mbumbulu, Nhlazuka and Tugela\nFerry. She also hopes to work with the St Wendolins community where she was\nborn and raised.<\/p>\n\n\n\n<p>‘Each community has its distinct systems and means of\nproduction, purchasing and food consumption patterns,’ she explained. ‘Through\nthis research, I hope to develop an electronic tool to aid households in making\nhealthier food choices and increase culinary skills specifically related to the\nfood system and environment around them.’<\/p>\n\n\n\n<p>Gwacela hopes that the hallmarks of her career will be\nthe passion she has for people, and for the communities with whom she has\nworked since she entered this field. She also hopes that her research will have\na positive impact on people’s lives, even if it is simply to broaden their\nthinking.<\/p>\n\n\n\n<p>Her achievements have been many, but among the most\nimportant for her was having her late grandmother, Ms Juliana Gwacela, attend\ntwo of her graduation ceremonies and hearing her ululating in the audience.<\/p>\n\n\n\n<p>‘She was my best cheerleader and supporter in all I\ndid,’ said Gwacela.<\/p>\n\n\n\n<p>Other notable accomplishments are achieving her\nmaster’s degree, serving as a panellist for the Academy of Science of South\nAfrica, and contributing to a Food Security and Policy Workshop for the SADC\nregion.<\/p>\n\n\n\n<p>Gwacela encouraged other young female scientists to\nlook for problems that only they understand, and to seize the opportunity to\nsolve problems that the world has been waiting for solutions to.<\/p>\n\n\n\n<p>All of our Wonder Women in Science could easily be\nundercover superheroes, so here is some inside info on the kind of superhero\nwe’ve found in Gwacela:<\/p>\n\n\n\n<p><strong>Q. What would your super power be and why?<\/strong><strong><br>\n<\/strong>A. The power to perfectly do 10 things\nall at once. I always have so much to do and so many places to be that it\ndrives me crazy. Every day I bear the burden of not doing as much as I could\nhave done.Having this superpower will help me sleep better at night.<\/p>\n\n\n\n<p><strong>Q.&nbsp;What song would be your theme\nsong?<\/strong><strong><br>\n<\/strong>A.&nbsp;<em>Heaven\nin You<\/em>&nbsp;by Hugh Masekela and J-something\nor&nbsp;<em>World Wide Woman<\/em>&nbsp;by Beyonce Knowles.<\/p>\n\n\n\n<p><strong>Q.&nbsp;What would your superhero gadget\nbe and why?<\/strong><strong><br>\n<\/strong>A.&nbsp;A pocket device that makes me\ntravel through matter at the speed of light.&nbsp;<\/p>\n\n\n\n<p><strong>Q.&nbsp;Who would be in your “all-star\nteam” to take on the world?<\/strong><strong><br>\n<\/strong>A.&nbsp;Dr Mjabu Ngidi; my sister,\nNonjabulo; Dr Emmanuel Obaga; Mr Simphiwe Mngomezulu-Dube; my mom, Miss\nThandiwe Gwacela; Miss Nonjabulo Mzimela; Mr Dali Shabane; Miss Olisa Mqamkana;\nMiss Ntandokazi Ninela “Ta”; Mrs Simphiwe Mngomezulu-Dube; Dr Emmanuel Obaga;\nDr Mjabu Ngidi, my supervisor; Professor Steve Worth; and Dr Karen\nCaister.&nbsp;<\/p>\n\n\n\n<p><strong>Q.&nbsp;Where would your secret lair\/ hide\nout be?<\/strong><strong><br>\n<\/strong>A. A bedroom with pastel-coloured,\nfeather linen and an incredibly soft bed that overlooks the seaside or a nature\nreserve.&nbsp;<\/p>\n\n\n\n<p><strong>Q.&nbsp;What is your kryptonite?<\/strong><strong><br>\n<\/strong>A. A peanut butter and jam sandwich,\ndried fruits and especially mangoes!<\/p>\n\n\n\n<p>For other inspirational Wonder Women In\nScience stories, visit:&nbsp;<a href=\"https:\/\/wwis.ukzn.ac.za\/\">wwis.ukzn.ac.za<\/a><\/p>\n\n\n\n<p>Words: <a href=\"mailto:Cuenod@ukzn.ac.za\">Christine Cuénod<\/a> <br>Photographs: Sashlin Girraj <\/p>\n","protected":false},"excerpt":{"rendered":"<p>To commemorate National Science Week and National Women’s Month, the College of Agriculture, Engineering and Science is honouring its female scientists through a Wonder Women In Science campaign. These women are passionate, pioneering and persistent heroines who are advancing science in their diverse fields. One of those “Wonder Women” is Ms Mbali Gwacela from the&nbsp;School of Agricultural, Earth and Environmental [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/news\/accidental-scientist-tackles-food-insecurity\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":6,"featured_media":15571,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3,27],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/15569"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=15569"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/15569\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media\/15571"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=15569"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=15569"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=15569"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}