{"id":15920,"date":"2019-11-22T15:37:04","date_gmt":"2019-11-22T13:37:04","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=15920"},"modified":"2019-11-22T15:50:39","modified_gmt":"2019-11-22T13:50:39","slug":"innovative-postharvest-technologies-the-answer-bioresources-engineer","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/news\/innovative-postharvest-technologies-the-answer-bioresources-engineer\/","title":{"rendered":"Innovative Postharvest Technologies the Answer – Bioresources Engineer"},"content":{"rendered":"\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img loading=\"lazy\" width=\"657\" height=\"375\" src=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/11\/Professor-Tilahun-Seyoum-Workneh-Inaugural-Lecture-2019.png\" alt=\"\" class=\"wp-image-15921\" srcset=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/11\/Professor-Tilahun-Seyoum-Workneh-Inaugural-Lecture-2019.png 657w, https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/11\/Professor-Tilahun-Seyoum-Workneh-Inaugural-Lecture-2019-300x171.png 300w\" sizes=\"(max-width: 657px) 100vw, 657px\" \/><figcaption>Professor Tilahun Seyoum Workneh (centre) with family and colleagues. <\/figcaption><\/figure><\/div>\n\n\n\n<p>Integrated, innovative postharvest \ntechnologies are capable of reducing losses in horticultural crops, says\n Professor Tilahun Seyoum Workneh.<\/p>\n\n\n\n<p>A Bioresources Engineer with a&nbsp;BSc in Agricultural Engineering from \nHaramaya University in Ethiopia, Workneh was addressing fellow academics\n and students at his inaugural lecture, which officially ushered him \ninto the UKZN professoriate.<\/p>\n\n\n\n<p>With a MScEng degree in Agricultural and Food Engineering from the \nUniversity College of Dublin in Ireland and a PhD in Food Science from \nthe University of the Free State, Workneh &#8211; a C2 NRF-rated researcher &#8211; \nhas during the course of his career developed low-cost appropriate \ncooling technologies, proving that they can assist in the extension of \nthe shelf life of fruit and vegetables.<\/p>\n\n\n\n<p>He has also developed an integrated postharvest technology by \ncombining pre-harvest and postharvest treatments of fruit and \nvegetables.<\/p>\n\n\n\n<p>‘African countries have a range of climates that are favourable for \nthe production of horticultural crops,’ said Workneh. ‘These countries \nhave attempted to intensify production but production in Africa is lower\n when compared to other continents. Also, the production has not been \nconsistent over successive years.’<\/p>\n\n\n\n<p>The reason for this was that little emphasis is placed on innovation \nand implementation of post-harvest technologies in the horticultural \nvalue chain, vital to stimulate the desired high harvest yields and \nreduce losses.<\/p>\n\n\n\n<p>‘The availability of affordable post-harvest technology is of the \nupmost importance to meet consistently high productivity, and to make \navailable high-quality fresh produce in markets. ‘Advanced post-harvest \ntechnologies which utilise complex machines that consume high energy are\n expensive for stakeholders in sub-Saharan Africa. Affordable low-cost \ninnovative post-harvest technologies have been developed and are ready \nfor implementation as intermediate technology to solve produce losses \nand ease food security challenges the continent is facing,’ he said.<\/p>\n\n\n\n<p>Workneh described several innovative and affordable coolers that have\n been developed, including a naturally ventilated, single-pad and \nmulti-pad evaporative cooler.<\/p>\n\n\n\n<p>‘Integrated post-harvest technologies combining environmentally \nfriendly disinfection treatment and evaporative cooling have proven \neffective in extending the shelf life of horticultural crops. When \ndeveloped, these integrated post-harvest technologies were found to be \neffective under hot, arid and semi-arid conditions.’<\/p>\n\n\n\n<p>Workneh, who has more than 28 years of experience in \nmultidisciplinary research in the area of agricultural engineering and \npostharvest technology, has received the School of Engineering’s \nResearch Excellence Award eight times.&nbsp;<\/p>\n\n\n\n<p>His research interests include heat and mass transfer; hybrid drying \ntechnology; food processing and preservation technologies; optimisation \nand modelling of food processes; postharvest technology and process \nengineering of fruit and vegetables; food quality and food safety \nengineering; engineered systems for food production; environmental \nmodification; and control for biological systems.<\/p>\n\n\n\n<p>He has published more than 110 scientific articles in peer-reviewed \ninternational and local journals in the multi-disciplinary research \nareas of agricultural processing, food science and postharvest \ntechnology, environmental control for biological commodities, and \nrenewable energy.<\/p>\n\n\n\n<p>Workneh has supervised 35 MSc and PhD students and four postdoctoral \nfellows, and has received a UKZN School of Engineering Best Lecturer \naward twice. He is a fellow of the South African Institute of \nAgricultural Engineers, a professional member of the South African \nAssociation of Food Science and Technology, and a member of the American\n Society of Agricultural and Biological Engineering.<\/p>\n\n\n\n<p>Words:&nbsp;<a href=\"mailto:frosts@ukzn.ac.za\">Sally Frost<\/a><\/p>\n\n\n\n<p>Photograph: Albert Hirasen<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Integrated, innovative postharvest technologies are capable of reducing losses in horticultural crops, says Professor Tilahun Seyoum Workneh. A Bioresources Engineer with a&nbsp;BSc in Agricultural Engineering from Haramaya University in Ethiopia, Workneh was addressing fellow academics and students at his inaugural lecture, which officially ushered him into the UKZN professoriate. With a MScEng degree in Agricultural [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/news\/innovative-postharvest-technologies-the-answer-bioresources-engineer\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":6,"featured_media":15922,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/15920"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/6"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=15920"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/15920\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media\/15922"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=15920"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=15920"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=15920"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}