{"id":18598,"date":"2022-10-28T08:57:34","date_gmt":"2022-10-28T06:57:34","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=18598"},"modified":"2022-10-28T08:57:34","modified_gmt":"2022-10-28T06:57:34","slug":"honours-student-scoops-prestigious-women-in-tech-award","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/news\/honours-student-scoops-prestigious-women-in-tech-award\/","title":{"rendered":"Honours Student Scoops Prestigious Women in Tech Award"},"content":{"rendered":"<div id=\"story\">\n<figure id=\"attachment_18599\" aria-describedby=\"caption-attachment-18599\" style=\"width: 400px\" class=\"wp-caption alignleft\"><img loading=\"lazy\" class=\"size-full wp-image-18599\" src=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/10\/Honours-Student-Nitasha-Pillay-Scoops-Prestigious-Women-In-Tech-Award.png\" alt=\"\" width=\"400\" height=\"250\" srcset=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/10\/Honours-Student-Nitasha-Pillay-Scoops-Prestigious-Women-In-Tech-Award.png 400w, https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/10\/Honours-Student-Nitasha-Pillay-Scoops-Prestigious-Women-In-Tech-Award-300x188.png 300w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><figcaption id=\"caption-attachment-18599\" class=\"wp-caption-text\">UKZN student Ms Nitasha Pillay with her Women in Tech Global Aspiring Teen Award.<\/figcaption><\/figure>\n<p>Information Systems and Technology Honours student Ms Nitasha Pillay was awarded the Aspiring Teen Award at the fifth annual Women in Tech Global Awards ceremony that took place in Dubai under the Patronage of Her Highness Sheikha Mozah bint Marwan Al Maktoum.<\/p>\n<p>The event was organised by Women in Tech, a global non-profit organisation committed to bridging the gender gap and establishing a strong network of women in tech worldwide.<\/p>\n<p>Eight winners from around the world were rewarded for their remarkable contributions to the tech industry.<\/p>\n<p>The Aspiring Teen Award &#8211; judged by an international jury of Tech experts &#8211; is for an individual whose efforts and actions in technology indicate they have a clear path to a successful future.<\/p>\n<p>Pillay was first a winner in the Women in Tech Africa Awards in Cape Town, going on to receive the global award in Dubai.<\/p>\n<p>‘It was an honour to be awarded the Global Aspiring Teen Award by Her Highness, Sheikha Mozah bint Marwan Al Maktoum, who is the first Lieutenant Pilot at Dubai Police Airwing and an inspiration to women around the world. Your gift will make room for you and bring you before great people, always have faith in yourself,’ said Pillay.<\/p>\n<p>She says she aims to use the experiences and knowledge gained through the Women in Tech Global Awards to make an impact in South Africa within the science, technology, engineering, and mathematics (STEM) space.<\/p>\n<p>‘Unemployment and lack of technical skills are major concerns in South Africa. The work we do at the Tech Society UKZN is to empower young people in areas of leadership, STEM and available opportunities. I believe that the heart of true leadership is to serve others and to pick up your fellow brother and sister when they are falling because we rise by lifting others.’<\/p>\n<p>Pillay, who graduated from UKZN with a Bachelor of Commerce in Marketing and Information Systems and Technology degree earlier this year, was appointed as a Women in Tech South Africa Youth Ambassador during the final year of her undergraduate studies and co-founded the Tech Society UKZN, a new student society aimed at empowering and mentoring students in the field of technology.<\/p>\n<p>She serves as a Social Media and Marketing Community Manager at Women in Tech South Africa, was a project manager of Enactus UKZN, and represented UKZN in the Innovate Durban’s 2021 Youth Innovation Challenge where her team prototyped their own technology aimed at minimising child trafficking, securing them second place and earning her a Zutari Woman in Design award.<\/p>\n<p>She was also the professional development director for the UKZN’s Golden Key Society on the Westville campus.<\/p>\n<p>Speaking about her trip to Dubai, Pillay says sourcing funding was a challenge. She thanked her family, the Harmony Centre Church, Youth in Harmony, Terence Pillay, Nathan Pillay, JB Travel, Kholeka Tsotsotso and Take Note IT for making her visit possible.<\/p>\n<p>‘I am here because someone believed in me. My mum, Pam Pillay, sourced a loan to ensure that this young South African Indian girl that has never seen the world, gets to be part of the Global Awards so I was grateful to have had my mum experience the journey with me. It is important to support the dreams of our youth and believe in their potential, you never know what the future holds for them.’<\/p>\n<p>Words: <a href=\"mailto:Jumo@ukzn.ac.za\">Thandiwe Jumo<\/a><\/p>\n<p>Photograph: Supplied<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Information Systems and Technology Honours student Ms Nitasha Pillay was awarded the Aspiring Teen Award at the fifth annual Women in Tech Global Awards ceremony that took place in Dubai under the Patronage of Her Highness Sheikha Mozah bint Marwan Al Maktoum. The event was organised by Women in Tech, a global non-profit organisation committed [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/news\/honours-student-scoops-prestigious-women-in-tech-award\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":2,"featured_media":18599,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18598"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=18598"}],"version-history":[{"count":1,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18598\/revisions"}],"predecessor-version":[{"id":18600,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18598\/revisions\/18600"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media\/18599"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=18598"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=18598"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=18598"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}