{"id":18627,"date":"2022-11-10T14:06:56","date_gmt":"2022-11-10T12:06:56","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=18627"},"modified":"2022-11-10T14:06:56","modified_gmt":"2022-11-10T12:06:56","slug":"law-academic-runner-up-in-national-three-minute-thesis-competition","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/news\/law-academic-runner-up-in-national-three-minute-thesis-competition\/","title":{"rendered":"Law Academic Runner-Up in National Three Minute Thesis Competition"},"content":{"rendered":"<div id=\"story\">\n<figure id=\"attachment_18628\" aria-describedby=\"caption-attachment-18628\" style=\"width: 400px\" class=\"wp-caption alignleft\"><img loading=\"lazy\" class=\"size-full wp-image-18628\" src=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/11\/Law-Academic-Suhayfa-Bhamjee-Scoops-Second-Place-at-the-National-three-Minute-Thesis-Competition.png\" alt=\"\" width=\"400\" height=\"250\" srcset=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/11\/Law-Academic-Suhayfa-Bhamjee-Scoops-Second-Place-at-the-National-three-Minute-Thesis-Competition.png 400w, https:\/\/ukzn.ac.za\/wp-content\/uploads\/2022\/11\/Law-Academic-Suhayfa-Bhamjee-Scoops-Second-Place-at-the-National-three-Minute-Thesis-Competition-300x188.png 300w\" sizes=\"(max-width: 400px) 100vw, 400px\" \/><figcaption id=\"caption-attachment-18628\" class=\"wp-caption-text\">Ms Suhayfa Bhamjee.<\/figcaption><\/figure>\n<p>School of Law Senior lecturer, Ms Suhayfa Bhamjee’s excellent ability of effectively explaining her PhD research in three minutes, earned her second place at the national Three Minute Thesis (3MT) competition.<\/p>\n<p>The competition was hosted by the University of Free State and saw 18 PhD participants &#8211; varying across the different disciplines &#8211; from nine South African universities compete for top honours. These competitors were selected following heats at the regional rounds of the competition hosted by their respective universities.<\/p>\n<p>Titled: Murder or Mercy? End-of-Life Decision Making and a Patient’s Right to Choose Euthanasia, Bhamjee’s presentation was based on her PhD thesis: Death and Dying in aConstitutional Democracy &#8211; An Analysis of the Criminal Law and a Call for Law Reform, which won her the UKZN Three-Minute Thesis Competition and also received the People’s Choice Award. At this leg of the competition, Mr Sylvester Mukono placed second at the UKZN heat. He also represented UKZN at the national competition. His presentation was titled: Scourging Slime and was based on his thesis: Biofilm Control in Water Supply Pipeline Systems.<\/p>\n<p>Speaking on her achievement, Bhamjee said summarising her research and explaining a complicated legal concept in layman’s terms was no easy feat, but is glad to have risen to the challenge.<\/p>\n<p>‘The competition made me think about how I communicate and transmit ideas to an audience that is wider than the legal fraternity. Lawyers are prone to being long-winded and verbose, so it felt quite against the rules of nature to sum up an entire PhD thesis in just three minutes. To fight every instinct to say <em>dolus <\/em>and<em> volenti<\/em> made me feel like a Jedi without a lightsaber!’ she said.<\/p>\n<p>Bhamjee revealed that her research findings include a parliament-ready piece of legislation which is expected to be presented to the relevant minister for consideration in due course.<\/p>\n<p>‘My thesis makes an argument for the decriminalisation of voluntary active euthanasia (VAE). I do this by looking at the doctrinal principles which are the foundations of criminal law and consider these principles in the light of medical professional ethics, patients’ rights and the Constitution. Murder is the “unlawful, intentional causing of death of another person”,’ explained Bhamjee.<\/p>\n<p>She added that the Law makes no liability distinction based on whether an accused person is a doctor, or whether the “victim” is a patient who has asked a doctor to help them die.<\/p>\n<p>‘Assessing intention and causation in euthanasia scenarios proved that euthanasia intends to and does cause death. However, a further issue is unlawfulness. Contextually, an argument is that the patient voluntarily requested euthanasia, and so the doctor’s role ought to be excusable because the patient consented. The law is clear: consent is never a defence to murder. Fearing prosecution and punishment, doctors refuse to help.’<\/p>\n<p>Bhamjee argues for the decriminalisation of VAE by focussing on consent, autonomy and dignity per medical practice, the law and the Constitution.<\/p>\n<p>‘As it stands, VAE is murder, but it does not have to be. I confirmed that doctors must and do routinely assess patient-competence, and proved that the same can be done when a patient requests VAE. Shortened life expectancy does not mean lack of competence &#8211; except of course when VAE is discussed. “Do no harm” also means “do not force patients to suffer”. I recommend law reforms by providing a complete piece of legislation, ready for parliamentary approval. The Medically Assisted Death with Dignity Bill sets the parameters for regulated VAE, allowing patients the freedom to choose and doctors the freedom to help. It is my great hope that the law reforms I recommend will assist in making realisable the wishes of patients who seek a dignified death with medical assistance,’ she said.<\/p>\n<p>The 3MT competition is an annual event, and UKZN will once again begin its preparations for the 2023 National Competition.<\/p>\n<p>Bhamjee is encouraging those who qualify to enter. ‘I encourage all PhD candidates to pick up the mantle and give it a go. The 3MT was one of the most challenging, yet liberating and affirming experiences I have ever encountered on this PhD journey. Aside from personal growth, the support and encouragement from my friends, family and colleagues has been overwhelming. Not only for the 3MT, but throughout the duration of my PhD journey. I am so humbled by it all. UKZN really is a place that allows you to find your voice and grow as an academic,’ she said.<\/p>\n<p>Words: <a href=\"mailto:Jumo@ukzn.ac.za\">Thandiwe Jumo<\/a><\/p>\n<p>Photograph: Supplied<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>School of Law Senior lecturer, Ms Suhayfa Bhamjee’s excellent ability of effectively explaining her PhD research in three minutes, earned her second place at the national Three Minute Thesis (3MT) competition. The competition was hosted by the University of Free State and saw 18 PhD participants &#8211; varying across the different disciplines &#8211; from nine [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/news\/law-academic-runner-up-in-national-three-minute-thesis-competition\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":2,"featured_media":18628,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18627"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=18627"}],"version-history":[{"count":1,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18627\/revisions"}],"predecessor-version":[{"id":18629,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/18627\/revisions\/18629"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media\/18628"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=18627"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=18627"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=18627"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}