{"id":4294,"date":"2017-02-02T13:15:03","date_gmt":"2017-02-02T11:15:03","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=4294"},"modified":"2017-06-06T13:05:03","modified_gmt":"2017-06-06T11:05:03","slug":"history","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/about-ukzn\/history\/","title":{"rendered":"History"},"content":{"rendered":"<p>The University of KwaZulu-Natal was formed on 1 January 2004 as a result of the merger between the University of Durban-Westville and the University of Natal. The new university brings together the rich histories of both the former Universities.<\/p>\n<p>The University of Durban-Westville was established in the 1960s as the University College for Indians on Salisbury Island in Durban Bay. Student numbers throughout the 1960s were low as a result of the Congress Alliances’ policy of shunning apartheid structures. This policy gave way in the 1980s to a strategy of “education under protest” which sought to transform apartheid institutions into sites of struggle. Student numbers grew rapidly and in 1971, the College was granted University status. The following year, the newly-named University of Durban-Westville moved into its modern campus in Westville and was a site of major anti-apartheid struggle. UDW became an autonomous institution in 1984, opening up to students of all races.<\/p>\n<p>Founded in 1910 as the Natal University College in Pietermaritzburg, the University of Natal was granted independent University status in 1949 owing to its rapid growth in numbers, its wide range of courses and its achievements in and opportunities for research. By that time, the NUC was already a multi-campus institution, having been extended to Durban after World War 1. The distinctive Howard College building was opened in 1931, following a donation by Mr T B Davis, whose son Howard Davis was killed during the Battle of Somme in World War I. In 1946, the government approved a Faculty of Agriculture in Pietermaritzburg and, in 1947, a Medical School for African, Indian and Coloured students in Durban.<\/p>\n<p>The two KwaZulu-Natal universities were among the first batch of South African institutions to merge in 2004 in accordance with the government’s higher educational restructuring plans that will eventually see the number of higher educational institutions in South Africa reduced from 36 to 21. Confirmed by a Cabinet decision in December 2002, the mergers are the culmination of a wide-ranging consultative process on the restructuring of the Higher Education Sector that began in the early 1990s.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The University of KwaZulu-Natal was formed on 1 January 2004 as a result of the merger between the University of Durban-Westville and the University of Natal. The new university brings together the rich histories of both the former Universities. The University of Durban-Westville was established in the 1960s as the University College for Indians on [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/about-ukzn\/history\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[62],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4294"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=4294"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4294\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=4294"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=4294"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=4294"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}