{"id":4296,"date":"2017-02-02T13:15:51","date_gmt":"2017-02-02T11:15:51","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=4296"},"modified":"2017-06-06T13:05:03","modified_gmt":"2017-06-06T11:05:03","slug":"history-zu","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/about-ukzn\/history-zu\/","title":{"rendered":"History"},"content":{"rendered":"<p>INyuvesi YaKwaZulu-Natal yasungulwa ngezi-01 kuMasingana 2004, kulandela ukuhlanganiswa kweNyuvesi yase-Durban Westville Kanye neNyuvesi yaseNatali. Inyuvesi entsha iqukethe umlando ngazo zombili lezi zikhungo esezihlanganisiwe.<\/p>\n<p>INyuvesi yase-Durban Westville yasungulwa ngonyaka we-1960’s njengeKolishi leNyuvesi lamaNdiya eSiqhingini saseSalisbury eChwebeni laseThekwini. Kuwo wonke unyaka we-1960, izibalo zabafundi zazincane kulandela ukuthi umbimbi lukaKhongolose (Congress Alliance) lwaluqhuba ngenqubomgomo yokugwema izihlaka zobandlululo. Le nqubomgomo yaholela ekusungulweni kwesu le “zemfundo ngaphansi ngomzabalazo” elalingama-1980’s, elalihlose ukuguqula izikhungo zobandlululo ngaphansi komzabalazo. Izibalo zabafundi zakhula ngonyaka we-1971, nokwaholela ekutheni iKolishi linikezwe imvume yokuba yiNyuvesi.Ngonyaka olandelayo, iNyuvesi neyayisiyaziwa ngokuthi yiNyuvesi yaseDurban-Westville, yathuthela ekhempasini entsha eWestville neyabe iwuphawu olugqamile lomzabalazo owawumelene nobandlululo. I-UDW yaba yisikhungo esizimele ngo-1984, nokwaholela ekutheni ivuleleke kubafundi bazo zonke izinhlanga.<\/p>\n<p>Ngakolunye uhlangothi, iNyuvesi yaseNatali neyasungulwa ngonyaka we-1910 njenge-Natal University College eMgungundlovu yahlinzekwa ngegunya lokuba yiNyuvesi ezimele ngowe-1949 kulandela ukukhula kwezibalo zabafundi, yizifundo ezinhlobonhlobo kanye nokuhlabana kwayo kwezocwaningo. Ngaleso sikhathi i-NUC yayisivele inamakhempasi ehlukene njengoba yayisikapakele naseThekwini ngemva kweMpi Yokuqala. Isakhiwo sekhethelo i-Howard College savulwa ngonyaka we-1931, kulandela umnikelo kaMnu. T.B. Davis, owayenendodana eyabulawa eMpini yaseSomme ngenkathi Sempi Yokuqala Yomhlaba. Ngonyaka we-1946, uHulumeni wagunyaza uMnyango Wezolimo eMgungundlovu, kwazothi ngo-1947, kwagunyazwa iSikole Sezokwelapha sabaMnyama, amaNdiya, kanye namaKhaladi eThekwini.<\/p>\n<p>Lezi zikhungo ezimbili eziKwaZulu-Natali zaba ngezinye zezikhungo zokuqala ukuba ziditshaniswe ngonyaka wezi-2004 kulandela amasu kaHulumeni ngezemfundo ephakeme azogcina ehlise izikhungo zemfundo ephakeme zisuka kwezingama-36 ziya kwezingama-21. Ukuditshaniswa kwamaNyuvesi nokwagunyazwa yiKhabhinethi ngoZibandlela wezi-2002, kungumphumela wochungechunge lokuxhumana nezinhlaka ezehlukene mayelana nokuguqulwa KoMkhakha Wezemfundo Ephakeme nokwaqala ngeminyaka yama-1990’s.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>INyuvesi YaKwaZulu-Natal yasungulwa ngezi-01 kuMasingana 2004, kulandela ukuhlanganiswa kweNyuvesi yase-Durban Westville Kanye neNyuvesi yaseNatali. Inyuvesi entsha iqukethe umlando ngazo zombili lezi zikhungo esezihlanganisiwe. INyuvesi yase-Durban Westville yasungulwa ngonyaka we-1960’s njengeKolishi leNyuvesi lamaNdiya eSiqhingini saseSalisbury eChwebeni laseThekwini. Kuwo wonke unyaka we-1960, izibalo zabafundi zazincane kulandela ukuthi umbimbi lukaKhongolose (Congress Alliance) lwaluqhuba ngenqubomgomo yokugwema izihlaka zobandlululo. Le [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/about-ukzn\/history-zu\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[62],"tags":[63],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4296"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=4296"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4296\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=4296"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=4296"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=4296"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}