{"id":4305,"date":"2017-02-02T13:36:05","date_gmt":"2017-02-02T11:36:05","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=4305"},"modified":"2017-06-06T13:05:03","modified_gmt":"2017-06-06T11:05:03","slug":"pact","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/about-ukzn\/pact\/","title":{"rendered":"Pact"},"content":{"rendered":"<p>A PACT is an agreement; a compact and a covenant between sovereigns. The <a href=\"https:\/\/ukzn.ac.za\/wp-content\/miscFiles\/aboutus\/UKZNpact.pdf\"><strong>UKZN PACT<\/strong><\/a> is a significant milestone in the life of our university. It is the product of a collaborative initiative between students and the broader university community since the merged university was born in 2004. The new merged university brought together a multiplicity of histories, cultures and values &#8211; common and diverse, consensual and contested.<\/p>\n<p>The PACT responds to the declared need for recognition of the rights and responsibilities of both staff and students to a common goal with respect to quality teaching and learning. The PACT represents a documented commitment of the UKZN community, binding all members to dedicate themselves to promoting the common goals of respect, dignity and commitment to quality education.<\/p>\n<p>One of the recommendations of the Hugh Africa Report as early as 2005, investigating the failure rate of students in the new university, was that both staff and students needed to develop a &#8220;pact&#8221; which identified rights and responsibilities to ensure a good teaching and learning student experience and consequent improved academic throughput and success. This proposal was referred to the University Teaching and Learning Committee (UTLC) and became the subject of review of factors influencing the ethos and culture of the institution. The proposal of a &#8220;pact&#8221; was mooted strongly by the students as a way of ensuring that the rights of students to quality teaching and learning are formally and actively promoted within the institution. The committee broadened the mandate of these rights to include a reciprocal co-responsibility of all members of the university community to commit themselves to ensuring a quality teaching and learning working ethos within the framework of the university rules and regulations.<\/p>\n<p>The PACT symbolises a beacon which guides all members of the university community, the staff (academic, management and support) and students in an honour code. The intention is not to develop contrived blind allegiance to a predetermined subject-hood and an institutional essentialism; nor is the pact intended to act as legal policy against which contractual obligations could be tested in a court of law or university disciplinary procedures. The aim is to present a written reference point which could be interpreted, critiqued and debated as a way of ensuring a focus on what constitutes quality teaching and learning, and how it could be achieved.<\/p>\n<p>Several versions of the document have been circulated within the University structures, and this shorter more concise version was finally endorsed by all sectors of the university community. The intention is that this precise enunciation of the UKZN PACT be engaged and displayed widely within the university community: publicised student diaries, faculty handbooks; as posters and banners to be displayed within lecture halls, University academic and public spaces, and on websites and the communication portals of the University.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A PACT is an agreement; a compact and a covenant between sovereigns. The UKZN PACT is a significant milestone in the life of our university. It is the product of a collaborative initiative between students and the broader university community since the merged university was born in 2004. The new merged university brought together a multiplicity [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/about-ukzn\/pact\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[62],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4305"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=4305"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4305\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=4305"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=4305"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=4305"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}