{"id":4333,"date":"2017-02-02T14:13:14","date_gmt":"2017-02-02T12:13:14","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=4333"},"modified":"2019-06-27T15:29:38","modified_gmt":"2019-06-27T13:29:38","slug":"vice-chancellor","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/about-ukzn\/vice-chancellor\/","title":{"rendered":"Vice-Chancellor &#038; Principal"},"content":{"rendered":"<p><img loading=\"lazy\" class=\"alignleft size-full wp-image-13035\" src=\"https:\/\/ukzn.ac.za\/wp-content\/uploads\/2019\/06\/Professor-Nana-Poku.png\" alt=\"\" width=\"120\" height=\"160\" \/><strong>Professor Nana Poku<\/strong><br \/>Acting PA \/ Secretary Ms Julie Reddy<br \/>Contact Number +27 (0) 31 260 2228<br \/>Fax Number +27 (0) 31 262 2192<br \/>Email <a href=\"mailto:reddyj1@ukzn.ac.za\">reddyj1@ukzn.ac.za<\/a><\/p>\n\n\n<p><br><\/p>\n\n\n\n<p><a>Professor Nana Poku is the Vice-Chancellor and Principal of the University of KwaZulu-Natal (UKZN) with effect from 24<sup>th<\/sup> June 2019.&nbsp; He previously served as the Deputy Vice-Chancellor of the College of Law and Management Studies at UKZN, and as Acting Vice-Chancellor and Principal from 1 October 2018. <\/a><\/p>\n\n\n\n<p>He\nholds a PhD in International Political Economy and has a distinguished career\nin research on the political economy of health and HIV and AIDS in sub-Saharan\nAfrica and substantial managerial experience in international organizations. <\/p>\n\n\n\n<p>Professor Poku also\nbrings with him a wealth of experience in Higher Education.&nbsp; He has served as Professor of African\nPolitics at the University of Bradford in the United Kingdom and was\nsubsequently appointed Dean for the School of Social and International Studies\nand later Pro-Vice-Chancellor for Research. <a>He returned\nto Africa to lead the African Union preparation for the Sustainable Development\nGoals; and within UKZN, served as the&nbsp;Executive Director of the Health\nEconomics and AIDS Research Institute (HEARD). <\/a><\/p>\n\n\n\n<p>He took up his post as Deputy Vice Chancellor of the\nCollege of Law and Management Studies at UKZN in 2017. Alongside his managerial and academic roles, Professor\nPoku has maintained his external development roles in Africa. In 2007, he was\nan expert witness to United States Congressional Committee on the President’s\nEmergency Plan for AIDS Relief (PEPFAR). During 2006-7, he was a member of the\nExpert Advisory Group to the EU Africa Governance Project; and from 2007 to\n2010, he served as a Special Advisor to British Government on Africa. Since\n2007, Professor Poku has been senior advisor on HIV and AIDS policies within\nPoverty Reduction Strategy Papers for the governments of Botswana, Ghana,\nMozambique, Malawi, Namibia, Kenya and Zambia, and over the past two decades\nhas worked in a senior capacity with the World Health Organisation, World Bank,\nUnited Nations Development Programme, UNAIDS, International Labour\nOrganisation, European Union, African Union, African Development Bank, Southern\nAfrican Development Community, and various national development agencies.<\/p>\n\n\n\n<p>The new Vice-Chancellor and\nPrincipal is passionate about research. His early research examined how Africa\nresponded to the socio-political and economic challenges posed by the HIV and\nAIDS epidemic. The findings have been significant in shaping global policy and led\nto Professor Poku being appointed by then-UN Secretary-General Kofi Annan to\nlead the Commission on HIV and AIDS and Governance in Africa. Professor Poku\nalso directed a World Bank programme of operational research (the Treatment\nAcceleration Programme) to test the feasibility of strengthening and scaling up\non-going HIV and AIDS treatment initiatives in Africa. The outcome of the\nprogramme was significant in influencing the World Health Organisation’s global\npolicy framework on the provision of complex AIDS-related medication in\nresource-poor settings.<\/p>\n\n\n\n<p>Professor Poku has a wide\narray of published work on globalisation and security, the HIV and AIDS\nepidemic in Africa, global health, governance, migration and human security. He\nhas authored\/edited\/co-authored numerous books and is widely published in peer-reviewed,&nbsp; internationally recognised journals,\nincluding Lancet, British Medical Journal, International Affairs, Review of\nInternational Studies, International Relations, and Third World Quarterly.<\/p>\n\n\n\n<p>Professor Poku was educated in\nthe United Kingdom. He received his BA (Hons) in Politics and Economics from\nthe University of Nottingham, his MA in International Political Economy was from\nNottingham Trent University and subsequent MSc in Third World Economics and\nDevelopment from Coventry University. He read for his PhD in International\nPolitical Economy at Nottingham Trent University.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Professor Nana PokuActing PA \/ Secretary Ms Julie ReddyContact Number +27 (0) 31 260 2228Fax Number +27 (0) 31 262 2192Email reddyj1@ukzn.ac.za Professor Nana Poku is the Vice-Chancellor and Principal of the University of KwaZulu-Natal (UKZN) with effect from 24th June 2019.&nbsp; He previously served as the Deputy Vice-Chancellor of the College of Law and [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/about-ukzn\/vice-chancellor\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[62],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4333"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=4333"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/4333\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=4333"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=4333"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=4333"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}