{"id":5412,"date":"2017-02-08T15:41:41","date_gmt":"2017-02-08T13:41:41","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=5412"},"modified":"2017-06-06T13:05:01","modified_gmt":"2017-06-06T11:05:01","slug":"sports-recreation","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/students\/sports-recreation\/","title":{"rendered":"Sports &#038; Recreation"},"content":{"rendered":"<p>Sport is an important part of University life and UKZN caters for everyone &#8211; from the recreational through to highly competitive persons.<\/p>\n<p>The Edgewood, Howard College, Pietermaritzburg, and Westville campuses all have an impressive range of indoor and outdoor facilities. Each of the campuses has its own tennis and squash courts, swimming pool, jogging areas and gymnasium for those who want to enjoy recreational sport in their own time. Those interested in a more structured sporting and competitive experience can join one or more of the available sports clubs, which provide excellent facilities, coaching and equipment for students who wish to compete at any level, from beginner through to international level.<\/p>\n<p>Some of the major sporting activities offered at the Edgewood campus include rugby, football, tennis, swimming, squash hockey and athletics. There are both indoor and outdoor facilities. The following sports and activities are presently offered at the Howard College and Pietermaritzburg campuses: athletics, aerobics, basketball, ballroom dancing, canoeing, chess, cricket, cycling, hockey, karate, mountaineering, netball, rowing, rugby, soccer, softball, squash, swimming, tennis, underwater sports, volleyball, water polo and yachting. Howard College, which has its own indoor sports complex, also offers gymnastics, surfing and badminton, while Pietermaritzburg also offers waterski, golf and boxing. The Westville campus boasts a well equipped and modern indoor sports complex and an Olympic-size swimming pool. The following sports are offered on the Westville campus: athletics, aerobics, badminton, basketball, boxing, ballroom dancing, chess, cricket, gymnastics, golf, hockey, karate, netball, soccer, softball, squash, swimming, table tennis, tenniquoite, volleyball and weightlifting. All sport is administered by the Sport Administration Office on each campus.<\/p>\n<p>University sport is affiliated to SASSU (South African Student Sports Union) and many opportunities are provided for competition at regional and national level, culminating in the World Student Games which are held biennially. Bursaries are available for top performers. Any student who is selected for provincial or national representation can apply to the Sports Administration for financial assistance.<\/p>\n<p>For more information please contact:<\/p>\n<table border=\"0\" width=\"100%\">\n<tbody>\n<tr>\n<th>Campus<\/th>\n<th>Telephone<\/th>\n<\/tr>\n<tr>\n<td>Edgewood<\/td>\n<td>(031) 260 3610<\/td>\n<\/tr>\n<tr>\n<td>Howard College<\/td>\n<td>(031) 260 2281<\/td>\n<\/tr>\n<tr>\n<td>Medical School<\/td>\n<td>(031) 260 2197<\/td>\n<\/tr>\n<tr>\n<td>Pietermaritzburg<\/td>\n<td>(033) 260 5189<\/td>\n<\/tr>\n<tr>\n<td>Westville<\/td>\n<td>(031) 260 7362<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n","protected":false},"excerpt":{"rendered":"<p>Sport is an important part of University life and UKZN caters for everyone &#8211; from the recreational through to highly competitive persons. The Edgewood, Howard College, Pietermaritzburg, and Westville campuses all have an impressive range of indoor and outdoor facilities. Each of the campuses has its own tennis and squash courts, swimming pool, jogging areas [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/students\/sports-recreation\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[93],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/5412"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=5412"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/5412\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=5412"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=5412"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=5412"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}