{"id":5830,"date":"2017-02-13T16:47:12","date_gmt":"2017-02-13T14:47:12","guid":{"rendered":"https:\/\/ukzn.ac.za\/?p=5830"},"modified":"2018-05-29T10:39:51","modified_gmt":"2018-05-29T08:39:51","slug":"welcome-to-ukzn","status":"publish","type":"post","link":"https:\/\/ukzn.ac.za\/general\/welcome-to-ukzn\/","title":{"rendered":"Welcome to UKZN"},"content":{"rendered":"<p>Welcome to the University of KwaZulu-Natal (UKZN) – a leading institution of higher learning on the African continent.<\/p>\n<p>The University of KwaZulu-Natal is a multi-campus, residential, teaching and research-led university located in the picturesque province of KwaZulu-Natal. The University has a proud and rich heritage of academic excellence. The year 2010 marked the centenary of Higher Education in the province of KwaZulu-Natal – a centenary of scholarship, innovation and community engagement. This vast wealth of knowledge production lies at the heart of the University’s success as one of the top institutions on the African continent.<\/p>\n<p>At UKZN we are passionate about teaching and learning. Our motto: <strong>Every Student Matters <\/strong>transcends the social, cultural and academic discourse across the disciplines. The University encourages and embraces diversity in all facets of the student experience. UKZN is one of three universities in South Africa and indeed in Africa rated amongst the top 500 universities of the world according to the Academic Rankings of World Universities (ARWU). The University is structured on a College model – each comprising academic Schools within which Disciplines offer a comprehensive range of undergraduate and postgraduate programmes across five campuses – Westville, Edgewood, Howard College, Medical School and Pietermaritzburg. Innovative curricula, dynamic teaching and learning, state –of-the art laboratories and accreditated professional degrees has earned the University the reputation as one of the leading institutions on the continent. Research activities span the natural, biomedical, humanities and social sciences.<\/p>\n<p>The University has a reputation for academic excellence. A recent ten year analysis by Thomson Reuters using the “InCites” international research analysis tool has rated mathematics research at UKZN number one in the country. According to the report of the Department of Higher Education and Training (DoHET) on the 2012 Institutional Research Publications Outputs, UKZN produced 1,424.22 publications units, which was the highest of the 23 publicly funded universities in South Africa.<\/p>\n<p>UKZN boasts 11 prestigious South African Science and Technology Research Chairs that range from Quantum Information Processing to Gravitating Systems – placing us fourth in the country for the number of such Chairs. UKZN boasts 6 NRF “A” Rated researchers – the fifth highest in the country.<\/p>\n<p>The University’s scientists play an integral role in the global fight against HIV \/AIDS and Tuberculosis. The Centre for AIDS Research in South Africa (CAPRISA), one of the largest HIV and AIDS research centres, is located at the University’s Medical School campus. Other major research centres in HIV and AIDS research include the Africa Centre for Health and Population Studies and the multi-million rand KwaZulu-Natal Research Institute for HIV and Tuberculosis (K-RITH)<\/p>\n<p>The University’s international partnerships in 44 countries provide an opportunity for direct interface and global academic exchange that enhances scholarship and the student experience. Join UKZN and embrace the many and diverse opportunities that await you.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Welcome to the University of KwaZulu-Natal (UKZN) – a leading institution of higher learning on the African continent. The University of KwaZulu-Natal is a multi-campus, residential, teaching and research-led university located in the picturesque province of KwaZulu-Natal. The University has a proud and rich heritage of academic excellence. The year 2010 marked the centenary of [&#8230;]<\/p>\n<p><a class=\"btn btn-secondary understrap-read-more-link\" href=\"https:\/\/ukzn.ac.za\/general\/welcome-to-ukzn\/\">Read More&#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[22],"tags":[],"_links":{"self":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/5830"}],"collection":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/comments?post=5830"}],"version-history":[{"count":0,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/posts\/5830\/revisions"}],"wp:attachment":[{"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/media?parent=5830"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/categories?post=5830"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ukzn.ac.za\/wp-json\/wp\/v2\/tags?post=5830"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}